app/controllers/accommodations_controller.rb

SELECT  "accommodations".* FROM "accommodations"   ORDER BY "accommodations"."id" DESC LIMIT 1
---
	def index
		binding.pry
		@accommodations = Accommodation.all

INSERT INTO "accommodations" ("address", "bathroom", "bedroom", "carpark", "created_at", "detail", "image", "price", "suburb", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
UPDATE "accommodations" SET "owner_id" = $1, "updated_at" = $2 WHERE "accommodations"."id" = 5  [["owner_id", 14], ["updated_at", "2014-10-09 04:48:26.911778"]]
---
	def create
		@accommodation = Accommodation.create accommodation_params
		binding.pry
		@accommodation.owner_id = @current_user.id
		binding.pry
		@accommodation.save

SELECT  "accommodations".* FROM "accommodations"  WHERE "accommodations"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@accommodation = Accommodation.find params[:id]

SELECT  "accommodations".* FROM "accommodations"  WHERE "accommodations"."id" = $1 LIMIT 1  [["id", 8]]
---
	def show
		@accommodation = Accommodation.find params[:id]

SELECT  "accommodations".* FROM "accommodations"  WHERE "accommodations"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "accommodations" SET "image" = $1, "updated_at" = $2 WHERE "accommodations"."id" = 3  [["image", "http://i1104.photobucket.com/albums/h332/csreverie/super-luxury-mansion20.jpg"], ["updated_at", "2014-10-09 22:41:51.538705"]]
---
	def update
		@accommodation = Accommodation.find params[:id]
		@accommodation.update accommodation_params

SELECT  "accommodations".* FROM "accommodations"  WHERE "accommodations"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "accommodations" WHERE "accommodations"."id" = $1  [["id", 3]]
---
	def destroy
		@accommodation = Accommodation.find params[:id]
		@accommodation.destroy