app/controllers/application_controller.rb

SELECT  "owners".* FROM "owners"  WHERE "owners"."id" IS NULL  ORDER BY "owners"."id" ASC LIMIT 1
---
  def authenticate
  	@current_user = Owner.where(:id => session[:owner_id]).first