app/controllers/owners_controller.rb

	def create
		@owner = Owner.create owner_params
---
INSERT INTO "owners" ("contact", "created_at", "email", "firstname", "image", "lastname", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

	def edit
		@owner = Owner.find params[:id]
---
SELECT  "owners".* FROM "owners"  WHERE "owners"."id" = 5  ORDER BY "owners"."id" ASC LIMIT 1

	def show
		@owner = Owner.find params[:id]
---
SELECT  "owners".* FROM "owners"  WHERE "owners"."id" = $1 LIMIT 1  [["id", 2]]