app/controllers/pages_controller.rb

SELECT "accommodations".* FROM "accommodations"
---
	def index
		@accommodations = Accommodation.all