app/controllers/session_controller.rb

SELECT  "owners".* FROM "owners"  WHERE "owners"."email" = 'jo@hotmail.com'  ORDER BY "owners"."id" ASC LIMIT 1
---
	def create
		owner = Owner.where(:email => params[:email]).first